package HomeworkTask2;

//Задача 2* (не обязательно)
//    Создайте класс Rectangle (прямоугольник).
//
//    При создании класс должен получать длины сторон.
//    Сохраните их в памяти как поля (атрибуты) класса "длина" и "ширина".
//
//    При попытке сравнить два прямоугольника они должны оказываться одинаковыми,
//    если сами прямоугольники как геометрические фигуры равны
//    - если их можно совместить, повернув и наложив друг на друга.

public class Rectangle {

  private int length;
  private int width;

  public Rectangle(int length, int width) {
    this.length = length;
    this.width = width;
  }
}
